lopple/ch32fun/minichlink/pgm-b003fun.c
#ifdef DEBUG_B003
	printf( "Read Binary Blob: %d bytes from %08x\n", read_size, address_to_read_from );
#endif

	if( ( address_to_read_from & 0x1 ) && read_size > 0 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_read_blob, sizeof(byte_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 1 ); // Read 1 bytes.
		if( CommitOp( eps, 0, 1 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 1 );
		blob++;
		read_size --;
		address_to_read_from++;
	}
	if( ( address_to_read_from & 0x2 ) && read_size > 1 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_read_blob, sizeof(half_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 2 ); // Read 2 bytes.
		if( CommitOp( eps, 0, 2 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 2 );
		blob += 2;
		read_size -= 2;
		address_to_read_from+=2;
	}
	while( read_size > 3 )
	{
		int to_read_this_time = read_size & (~3);
		if( to_read_this_time > eps->scratchpad_data_size ) to_read_this_time = eps->scratchpad_data_size;

		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, word_wise_read_blob, sizeof(word_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, to_read_this_time ); // Read 4 bytes.
		if( CommitOp( eps, 0, to_read_this_time ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], to_read_this_time );
		blob += to_read_this_time;
		read_size -= to_read_this_time;
		address_to_read_from += to_read_this_time;
	}
	if( read_size > 1 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_read_blob, sizeof(half_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 2 ); // Read 2 bytes.
		if( CommitOp( eps, 0, 2 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 2 );
		blob += 2;
		read_size -= 2;
		address_to_read_from += 2;
	}
	if( read_size )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_read_blob, sizeof(byte_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 1 ); // Read 1 byte.
		if( CommitOp( eps, 0, 1 ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 1 );
		blob += 1;
		read_size -= 1;
		address_to_read_from+=1;
	}
	return 0;
}

static int InternalB003FunBoot( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;

	printf( "Booting\n" );
	ResetOp( eps );
	WriteOpArb( eps, run_app_blob, sizeof(run_app_blob) );
	// for( int i = 0; i < 128; i++ )
	// {
	// 	printf( "%02x ", eps->commandbuffer[i] );
	// }
	// printf( "\n" );
	eps->no_get_report = 1;
	if( CommitOp( eps, 0, 0 ) ) return -5;
	return 0;
}

static int B003FunSetupInterface( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = (struct InternalState*)(((struct B003FunProgrammerStruct*)eps)->internal);
	iss->target_chip = &ch32v003;

	printf( "Halting Boot Countdown\n" );
	ResetOp( eps );
	WriteOpArb( eps, halt_wait_blob, sizeof(halt_wait_blob) );
	if( CommitOp( eps, 0, 0 ) ) return -5;

	// Check for minimum 8 byte feature
	eps->respbuffer[0] = 0xa8;
	int r = B003FunGetFeatureReport( eps, eps->respbuffer, 8 );
	if( r != 8 ) eps->no_eight_byte = 1;
	else eps->no_eight_byte = 0;
	// Check for the maximum buffer size available
	eps->respbuffer[0] = 0xad;
	// 4096 is the maximum size for windows and mac
	r = B003FunGetFeatureReport( eps, eps->respbuffer, 4096 );
	if( r >= 0 ) // If not on Windows, or guessed the first time
	{
		eps->scratchpad_size = r;
		// Check once more, if we can go higher
		// On windows and mac it will fail, on linux we will get an actual maximum HID report size
		eps->respbuffer[0] = 0xb0;
		r = B003FunGetFeatureReport( eps, eps->respbuffer, 6144+128 );
		if( r > eps->scratchpad_size ) eps->scratchpad_size = r;
	}
	else
	{
		for( int i = 0xac; i > 0xaa; i-- )
		{
			int id_size = 5120 - (1024*(0xaf - i)) + 128;
			eps->respbuffer[0] = i;
			r = B003FunGetFeatureReport( eps, eps->respbuffer, id_size );
			if( r == id_size )
			{
				eps->scratchpad_size = id_size;
				break;
			}
		}
	}
	if( eps->scratchpad_size >= (128 + 1024) ) eps->scratchpad_data_size = eps->scratchpad_size - 128;

	uint32_t one;
	int two;
	uint8_t read_protection = 0;
	uint32_t chip_id = 0;
	MCF.ReadWord( dev, 0x4002201c, &one );
	MCF.ReadWord( dev, 0x40022020, (uint32_t*)&two );
	MCF.ReadWord( dev, 0x1ffff7c4, &chip_id );
	
	if( (one & 2) || two != -1 ) read_protection = 1;

	if( chip_id == 0xffffffff )
	{
		MCF.ReadWord( dev, 0x1ffff704, &chip_id );
		if( (chip_id & 0xfff00000) == 0x00200000 )
		{
			iss->target_chip = &ch32v002;
		}
		else if( (chip_id & 0xfff00000) == 0x00400000 )
		{
			iss->target_chip = &ch32v004;
		}
		else if( (chip_id & 0xfff00000) == 0x00500000 )
		{
			iss->target_chip = &ch32v005;
		}
		else if( (chip_id & 0xfff00000) == 0x00600000 )
		{
			iss->target_chip = &ch32v006;
		}
		else if( (chip_id & 0xfff00000) == 0x00700000 )
		{
			iss->target_chip = &ch32v007;
		}
	}

	iss->target_chip_id = chip_id;
	iss->target_chip_type = iss->target_chip->family_id;
	iss->flash_size = iss->target_chip->flash_size/1024;
	iss->ram_base = iss->target_chip->ram_base;
	iss->ram_size = iss->target_chip->ram_size;
	iss->sector_size = iss->target_chip->sector_size;
	uint8_t * part_type = (uint8_t*)&iss->target_chip_id;
	uint8_t uuid[8];
	fprintf( stderr, "Detected %s\n", iss->target_chip->name_str );
	fprintf(stderr, "HID buffer: %d bytes\n", eps->scratchpad_size );	// Can remove this line in future versions
	fprintf( stderr, "Flash Storage: %d kB\n", iss->flash_size );
	if( MCF.GetUUID( dev, uuid ) ) fprintf( stderr, "Couldn't read UUID\n" );
	else fprintf( stderr, "Part UUID: %02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x\n", uuid[0], uuid[1], uuid[2], uuid[3], uuid[4], uuid[5], uuid[6], uuid[7] );
	fprintf( stderr, "Part Type: %02x-%02x-%02x-%02x\n", part_type[3], part_type[2], part_type[1], part_type[0] );
	fprintf( stderr, "Read protection: %s\n", (read_protection > 0)?"enabled":"disabled" );
	return 0;
}

static int B003FunExit( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	if( eps->hd )
	{
		hid_close( eps->hd );
		eps->hd = 0;
	}
#ifdef __MACOSX__
	if( eps->usb_devh )
	{
		libusb_close( eps->usb_devh );
		eps->usb_devh = 0;
	}
	if( eps->usb_ctx )
	{
		libusb_exit( eps->usb_ctx );
		eps->usb_ctx = 0;
	}
#endif
	return 0;
}

// MUST be 4-byte-aligned.
static int B003FunWriteWord( void * dev, uint32_t address_to_write, uint32_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 4, (uint8_t*)&data );
}

static int B003FunReadWord( void * dev, uint32_t address_to_read, uint32_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 4, (uint8_t*)data );
}

static int B003FunBlockWrite64( void * dev, uint32_t address_to_write, const uint8_t * data )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = eps->internal;

